{
  "_name_or_path": "google/vit-base-patch16-384",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "door_scratch",
    "1": "glass_shatter",
    "2": "bumper_scratch",
    "3": "door_dent",
    "4": "head_lamp",
    "5": "bumper_dent",
    "6": "tail_lamp"
  },
  "image_size": 384,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "bumper_dent": 5,
    "bumper_scratch": 2,
    "door_dent": 3,
    "door_scratch": 0,
    "glass_shatter": 1,
    "head_lamp": 4,
    "tail_lamp": 6
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.26.1"
}
